In [27]:
#importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [28]:
path= r'/Users/eleni_icon/09-2024 Instacart Basket Analysis'

In [29]:
# importing dataframe
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# Data wrangling

In [30]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [31]:
df_customers.shape

(206209, 10)

In [32]:
#Rename columns
df_customers.rename(columns={
    'First Name': 'First_Name',
    'Surnam': 'Last_Name',
    'STATE': 'State',
    'n_dependants': 'Num_of_Dependants',
    'date_joined':'Date_joined',
    'fam_status':'Family_Status',
    'income':'Income'
}, inplace=True)

In [33]:
df_customers.head()

,user_id,First_Name,Last_Name,Gender,State,Age,Date_joined,Num_of_Dependants,Family_Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [34]:
df_customers.describe()

             user_id            Age  Num_of_Dependants         Income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [35]:
# Finding missing values
missing_values = df_customers.isnull().sum()

In [36]:
missing_values

user_id                  0
First_Name           11259
Last_Name                0
Gender                   0
State                    0
Age                      0
Date_joined              0
Num_of_Dependants        0
Family_Status            0
Income                   0
dtype: int64

In [37]:
# Fill missing values
df_customers['First_Name'] = df_customers['First_Name'].fillna('Unknown')

In [38]:
# Find duplicates
df_customers.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [39]:
#Count the duplicates
df_customers.duplicated().sum()

0

In [40]:
#Check data types
df_customers.dtypes

user_id               int64
First_Name           object
Last_Name            object
Gender               object
State                object
Age                   int64
Date_joined          object
Num_of_Dependants     int64
Family_Status        object
Income                int64
dtype: object

# Combine DataFrames

In [41]:
# Import dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined_merged_new_variables_derived_aggregated.pkl'))

In [42]:
# Combine customer with ords_prods_merge
merged_df = pd.merge(ords_prods_merge, df_customers, on='user_id', how='inner')

In [43]:
# Check merge
merged_df.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,frequency_flag,First_Name,Last_Name,Gender,State,Age,Date_joined,Num_of_Dependants,Family_Status,Income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [44]:
merged_df.shape

(32399732, 35)

In [45]:
#Export as a pickle
merged_df.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))